#define _CRT_SECURE_NO_WARNINGS 1
#include <stdio.h>

// 数组：一组相同数据类型的元素的集合

//int main()
//{
//	//int arr1[10];
//
//	// 完全初始化
//	//int arr2[10] = {1,2,3,4,5,6,7,8,10};
//
//	// 不完全初始化,后面默认初始化为0
//	//int arr3[10] = {1,2,3,4,5};
//
//	// 根据初始化内容确定元素个数，相当于 int arr4[5] = {1,2,3,4,5};
//	//int arr4[] = {1,2,3,4,5};
//
//	//char ch1[4] = "abc";
//	//char ch2[] = "abc";
//
//	/*char ch1[] = "abc";
//	char ch2[] = {'a', 'b', 'c'};
//	printf("%s\n", ch1);
//	printf("%s\n", ch2);*/
//
//	// 一维数组在内存中是连续存放的
//	// 随着数组下标的增长，地址是由低到高变化的
//
//	return 0;
//}